# -*- coding: utf-8 -*-
from django.utils.translation import ugettext_lazy as _

PHONE_TYPE_CHOICES = (
    ('K', 'Касса'),
    ('O', 'Автоответчик'),
    ('B', 'Бухгалтерия'),
    ('D', 'Директор'),
    ('S', 'Справочная'),
    ('A', 'Администратор'),
    ('F', 'Факс'),
    ('N', 'Неопределен'),
)

SITE_TYPE_CHOICES = (
    ('O', 'Официальный'),
    ('A', 'Городская афиша'),
    ('B', 'ВКонтакте'),
)

CURRENCY_CHOICES = (
    ('1', 'USD'),
    ('2', 'EUR'),
    ('3', 'AUD'),
    ('4', 'RUB'),
    ('5', 'UAH'),
    ('6', 'NZD')
)

FILM_TYPE_CHOICES = (
    ('I', 'игровой'),
    ('A', 'анимационный'),
    ('D', 'документальный'),
    ('R', 'рекламный'),
    ('M', 'музыкальный'),
)

FILM_RELEASE_FORMAT = (
    ('0', 'Обычный'),
    ('1', 'Фестиваль'),
    ('2', 'Limited'),
    ('3', 'DVD'),
    ('4', 'Blu-Ray'),
    ('5', 'Internet'),
    ('6', '3D'),
    ('7', 'Другой'),
    ('8', 'TV'),
)

IMAGES_STATUS = (
    ('0', 'Постер основной'),
    ('1', 'Постер второстепенный'),
    ('2', 'Слайд/Кадр'),
)

RATED_CHOICES = (
    ('G', 'детский'),
    ('PG', 'семейный'),
    ('PG-13', 'подростковый'),
    ('R', 'взрослый'),
    ('NC-17', 'специальный'),
)

DIMENSION_CHOICES = (
    ('2', 'плоское'),
    ('3', 'объемное'),
    ('9', 'смешанное'),
)

COLOR_CHOICES = (
    ('C', 'цветное'),
    ('B', 'чернобелое'),
    ('9', 'смешанное'),
)

ASPECT_RATIO_CHOICES = (
    ('O', '4:3'),
    ('S', '16:9'),
    ('A', 'IMAX'),
)

SOUNDSYSTEM_CHOICES = (
    ('D', 'Dolby Digital'),
    ('T', 'DTS'),
    ('S', 'SDDS'),
)

SOUND_CHOICES = (
    ('1', '1.0'),
    ('2', '2.0'),
    ('5', '5.1'),
    ('7', '7.1'),
)

ORG_TYPE_CHOICES = (
    ('C', 'Студия'),
    ('Д', 'Дистрибьютор'),
    ('Э', 'Спецэффекты'),
)

RSS_FEEDS_CHOICES = (
    ('1', 'Сеансы'),
    ('2', 'Релизы'),
    ('3', 'Статьи'),
    ('4', 'Новости Ялты'),
    ('5', 'Новости Орска'),
    ('6', 'Lets Get Rhythm news'),
    ('7', 'Посты Memoirs'),
)

SUBSCRIBE_TYPE = (
    ('1', 'Блоги'),
    ('2', 'Ответы на коммент в блоге'),
    ('3', 'Все комменты в блоге'),
    ('4', 'Уведомление по рекламной кампании'),
    ('5', 'Отчет по окончанию рекламной кампании'),
)

STREET_TYPE_CHOICES = (
    ('1', 'улица'),
    ('2', 'переулок'),
    ('3', 'площадь'),
    ('4', 'набережная'),
    ('5', 'шоссе'),
    ('6', 'проспект'),
    ('7', 'проезд'),
    ('8', 'аллея'),
    ('9', 'бульвар'),
    ('10', 'парк'),
    ('11', 'тупик'),
    ('12', 'км'),
    ('13', 'микрорайон'),
    ('14', 'квартал'),
    ('70', 'St'),
    ('71', 'Rd'),
    ('72', 'Ave'),
    ('73', 'Hwy'),
    ('74', 'Dr'),
    ('75', 'Crt'),
    ('76', 'Pde'),
)

OWNERSHIP_CHOICES = (
    ('', '-------'),
    ('1', 'ООО'),
    ('2', 'ЗАО'),
    ('3', 'ОАО'),
    ('4', 'ФЛП'),
    ('5', 'ЧП'),
    ('6', 'ИП'),
)

ROOM_TYPE_CHOICES = (
    ('1', 'Офис'),
    ('2', 'Кабинет'),
    ('3', 'Квартира'),
)

ACTION_CHOICES = (
    ('1', 'добавл.'),
    ('2', 'измен.'),
    ('3', 'удал.'),
    ('4', 'Кнопка Приглашения'),
)

ACTION_OBJ_CHOICES = (
    ('0', _(u'Другое')),
    ('1', _(u'Организация')),
    ('2', _(u'Персона')),
    ('3', _(u'Фильм')),
    ('4', _(u'Меню')),
    ('5', _(u'ПодМеню')),
    ('6', _(u'Блог')),
    ('7', _(u'Галерея')),
    ('8', _(u'Работа')),
    ('9', _(u'События')),
    ('10', _(u'Клиенты')),
    ('11', _(u'Реклама')),
)

SHOW_PROFILE_CHOICES = (
    ('1', _(u'Всем')),
    ('2', _(u'Только мне')),
)

TAG_GROUP_CHOICES = (
    ('1', 'Название'),
    ('2', 'Ориентир'),
    ('3', 'Предложение'),
    ('4', 'Спрос'),
)

NEWS_CHOICES = (
    ('0', 'Черновик'),
    ('1', 'ПМ'),
    ('2', 'ПМ нескольким'),
    ('3', 'Доступно подписчикам'),
    ('4', 'Доступно городу'),
    ('5', 'Доступно стране'),
    ('6', 'Доступно миру'),
    ('7', 'Обратная связь'),
    ('8', 'Отзыв'),
    ('9', 'Вопрос орг.'),
    ('10', 'Коммент'),
    ('11', 'Предложение'),
    ('12', 'Спрос'),
    ('13', 'Текст на главной'),
    ('14', 'Рецензия'),
    ('15', 'Invitation'),
    ('16', 'Invoice'),
    ('17', 'Новости kinoafisha.ru'),
    ('18', 'Новости мирового кино'),
    ('19', 'Новости российского кино'),
    ('20', 'Рекламные статьи kinoafisha.ru'),
    ('21', 'Темы и обзоры'),
    ('22', 'Вопрос IMIAGroup'),
    ('23', 'Ответ IMIAGroup'),
    ('24', 'Обсуждение задания (управление проектами)'),


)

MESSENGER_CHOICES = (
    ('0', 'Непрочитаное'),
    ('1', 'Удалено'),
    ('2', 'Прочитанное'),
    ('3', 'Отвеченное'),
    ('4', 'Собственное'),
)

INTERFACE_CHOICES = (
    ('1', 'текстовый интерфейс'),
    ('0', 'графический интерфейс'),
)

SLIDEBLOCK_PARTS = (
    ('1', 'текстовый интерфейс'),
    ('2', 'графический интерфейс'),
    ('3', 'графический интерфейс'),
    ('4', 'Новинки Рутрекера'),
)

AWARDS_CHOICES = (
    ('1', 'Номинация'),
    ('2', 'Награда'),
)

FEST_TYPE_CHOICES = (
    ('1', 'Конкурс'),
    ('2', 'Фестиваль'),
)

MONTHES_CHOICES = (
    ('1', u'Январь'),
    ('2', u'Февраль'),
    ('3', u'Март'),
    ('4', u'Апрель'),
    ('5', u'Май'),
    ('6', u'Июль'),
    ('7', u'Июнь'),
    ('8', u'Август'),
    ('9', u'Сентябрь'),
    ('10', u'Октябрь'),
    ('11', u'Ноябрь'),
    ('12', u'Декабрь'),
)

TIME_MSG_CHOICES = (
    ('1', _(u'за 5 минут')),
    ('2', _(u'за 15 минут')),
    ('3', _(u'за 30 минут')),
    ('4', _(u'за 1 час')),
    ('5', _(u'за 2 часа')),
    ('6', _(u'за 3 часа')),
    ('7', _(u'за 4 часа')),
    ('8', _(u'за 5 часов')),
    ('9', _(u'за 1 сутки')),
)

LETSGET_EVENTS_TYPE = (
    ('1', 'Nursing Home, $150'),
    ('2', 'Corporate, $250'),
    ('3', 'Gig, $100'),
    ('4', 'School, $150'),
)

PAGE_TYPES_CHOICES = (
    ('1', _(u'Текст / Блог')),
    ('2', _(u'Фотогалерея')),
)

JOB_PROJECTS_NAMES = (
    ('1', 'Киноинфо'),
    ('2', 'Минусовки'),
)

MUSIC_TYPE = (
    ('0', 'Нет'),
    ('1', 'Минус'),
    ('2', 'Плюс'),
    ('3', 'Табулатура'),
)

BANNER_TYPE = (
    ('0', 'Отключение фона'),
    ('1', 'Текстовый блок под левым меню (весь сайт)'),
    ('2', 'Фон (весь сайт)'),
    ('3', 'Фон (страница юзера)'),
    ('4', 'SWF блок под левым меню (страница юзера)'),
    ('5', 'SWF блок под левым меню (весь сайт)'),
    ('6', 'Мобильный блок перед подвалом'),
    ('7', 'Встроенный код под левым меню (весь сайт)')
)

TORRENT_QUALITY = (
    ('0', 'Плохое'),
    ('1', 'Хорошее'),
    ('2', 'Отличное'),
)

BOOKER_PERMISSION = (
    ('0', 'Только чтение'),
    ('1', 'Чтение и запись'),
)
